package com.minigame.demo.constant;

public class PrintMessage {
    public static final String EXIT_MESSAGE = "게임이 종료됩니다...";
    public static final String GAME_CHOICE_POSSIBLE_INPUT_MESSAGE = "공백없이 오직 1, 2, 3 또는 0만 입력가능합니다 !";
    public static final String RE_INPUT_MESSAGE = "다시 입력해주세요.";
    public static final String BLOCK_MESSAGE = "▓";
    public static final String WELCOME_MESSAGE =
            "   _    _        _                                  _             _    _                         _         _                                     _ \n" +
                    "  | |  | |      | |                                | |           | |  | |                       (_)       (_)                                   | |\n" +
                    "  | |  | |  ___ | |  ___   ___   _ __ ___    ___   | |_   ___    | |_ | |__    ___    _ __ ___   _  _ __   _     __ _   __ _  _ __ ___    ___   | |\n" +
                    "  | |/\\| | / _ \\| | / __| / _ \\ | '_ ` _ \\  / _ \\  | __| / _ \\   | __|| '_ \\  / _ \\  | '_ ` _ \\ | || '_ \\ | |   / _` | / _` || '_ ` _ \\  / _ \\  | |\n" +
                    "  \\  /\\  /|  __/| || (__ | (_) || | | | | ||  __/  | |_ | (_) |  | |_ | | | ||  __/  | | | | | || || | | || |  | (_| || (_| || | | | | ||  __/  |_|\n" +
                    "   \\/  \\/  \\___||_| \\___| \\___/ |_| |_| |_| \\___|   \\__| \\___/    \\__||_| |_| \\___|  |_| |_| |_||_||_| |_||_|   \\__, | \\__,_||_| |_| |_| \\___|  (_)\n" +
                    "                                                                                                                 __/ |                             ";
    public static final String GAME_LIST_MASSAGE = "───────────────────\n" +
            " 1⃣  🎱 미니 로또 - HARD\n" +
            " 2⃣  ⏰ 타이머 - EASY\n" +
            " 3⃣  🏎 스피드 코딩️ - MEDIUM\n" +
            " 0⃣  🚪 게임 종료 \n" +
            "───────────────────";
}
